In [2]:
import pandas as pd
import matplotlib.pyplot as plt

df = pd.read_csv("Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [3]:
#Missing Values per Column
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [14]:
#Percentage of Missing Values per Column
(df.isnull().sum() / len(df)) * 100

PassengerId     0.000000
Survived        0.000000
Pclass          0.000000
Name            0.000000
Sex             0.000000
Age            19.865320
SibSp           0.000000
Parch           0.000000
Ticket          0.000000
Fare            0.000000
Cabin          77.104377
Embarked        0.224467
dtype: float64

In [4]:
#Handling Missing Values for Age
print(df.groupby('Survived')['Age'].std())

df['Age_filled'] = df['Age'].fillna(df['Age'].mean())
df.head()

Survived
0    14.172110
1    14.950952
Name: Age, dtype: float64

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_filled
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.0

In [9]:
#Interpretation:
#Passengers who died (Survived = 0) had an age std dev of 14.17
#Passengers who survived (Survived = 1) had a slightly higher std dev of 14.95

#There was slightly more age variation among survivors compared to those who did not survive. 
#This means survivors ranged more broadly in age — from children to elderly — while those who died were slightly more clustered around the average.

In [7]:
# Standard deviation of original Age column
print("Std Dev of Age:", df['Age'].std())

# Standard deviation of filled Age column
print("Std Dev of Age_filled:", df['Age_filled'].std())

Std Dev of Age: 14.526497332334042
Std Dev of Age_filled: 13.002015226002882

In [8]:
#Interpretation:
#After replacing missing age values with the mean, the overall standard deviation decreased to 13.00.
#This is expected because:
       #Filling missing values with a constant (mean) adds more values near the average. 
       #That reduces the spread of the data (hence lower std dev).

In [10]:
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [12]:
df['Age_gender_filled'] = df['Age']

# Fill NaN values based on mean age per gender
df['Age_gender_filled'] = df.groupby('Sex')['Age'].transform(lambda x: x.fillna(x.mean()))
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_filled,Age_gender_filled
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.0,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.0,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.0,35.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.0,35.0

In [14]:
# Standard deviation of filled Age based on gender column
print("Std Dev of Age_filled_Gender:", df['Age_gender_filled'].std())

Std Dev of Age_filled_Gender: 13.014896879381995

In [15]:
df.groupby('Sex')['Age_gender_filled'].std()

Sex
female    12.860150
male      13.002618
Name: Age_gender_filled, dtype: float64

In [18]:
print("Original Age Std Dev:", df['Age'].std())
print("Std Dev of Age_filled:", df['Age_filled'].std())
print("Gender-filled Age Std Dev:", df['Age_gender_filled'].std())

Original Age Std Dev: 14.526497332334042
Std Dev of Age_filled: 13.002015226002882
Gender-filled Age Std Dev: 13.014896879381995